import React from 'react'
import BottomTelegramIcon from '../assets/icons/TelegramIcon'
import TelegramIcon from '../assets/icons/TelegramIcon'
import FacebookIcon from '../assets/icons/FacebookIcon'
import InstagramIcon from '../assets/icons/InstagramIcon'

function Footer() {
  return (
    <footer className='footer'>
      <div className="footer__wrap">
        <div className="footer__title">
          <div className="footer__logo">

            <div className="idea">
              <svg width="105" height="43" viewBox="0 0 105 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M1.17175 1.70883C-0.390585 3.26687 -0.390585 5.69795 1.17175 7.30972C2.78797 8.86777 5.22578 8.86777 6.78812 7.30972C8.4178 5.69795 8.41779 3.26687 6.84198 1.70883C5.27964 0.0970579 2.73409 0.0970579 1.17175 1.70883Z" fill="white"></path>
                <path d="M7.13783 12.8037H0.875V41.7081H7.13783V12.8037Z" fill="white"></path>
                <path d="M57.9951 12.0645C53.537 12.0645 49.8197 13.5151 46.9779 16.4565C44.7017 18.7802 43.328 21.5605 42.87 24.7974C42.87 24.8243 42.8431 24.8377 42.8296 24.8377H40.1629C40.1359 24.8377 40.1225 24.8243 40.1225 24.7974V1.30592C40.1225 1.27905 40.109 1.26562 40.082 1.26562H33.9135C33.8866 1.26562 33.8731 1.27905 33.8731 1.30592V16.8058C33.8731 16.8461 33.8192 16.8595 33.7923 16.8326C31.4219 13.6628 28.0817 12.0779 23.7314 12.0779C19.7312 12.0779 16.3776 13.5285 13.5357 16.47C10.6939 19.4115 9.30664 22.9976 9.30664 27.2823C9.30664 31.4997 10.6939 35.1396 13.5357 38.0945C16.3776 41.036 19.7312 42.4866 23.7314 42.4866C28.0951 42.4866 31.4219 40.9017 33.7923 37.6782C33.8192 37.6513 33.8731 37.6647 33.8731 37.705V41.6941C33.8731 41.721 33.8866 41.7344 33.9135 41.7344H40.082C40.109 41.7344 40.1225 41.721 40.1225 41.6941V29.9954C40.1225 29.9685 40.1359 29.9551 40.1629 29.9551H42.87C42.897 29.9551 42.9104 29.9685 42.9104 29.9954C43.3953 33.2055 44.7691 35.9455 47.0452 38.2288C49.941 41.0629 53.766 42.5 58.4665 42.5C64.0693 42.5 68.2984 40.4316 71.1268 36.241C71.1403 36.2141 71.1403 36.1873 71.1133 36.1738L66.0358 33.2055C66.0223 33.1921 65.9954 33.2055 65.9819 33.2189C64.2983 35.5694 61.8201 36.7648 58.5338 36.7648C53.739 36.7648 50.2238 34.3606 49.2675 29.9954C49.2675 29.9685 49.281 29.9417 49.3079 29.9417H72.2851C72.312 29.9417 72.3255 29.9282 72.3255 29.9014C72.5006 28.8269 72.5545 27.9673 72.5545 27.336C72.5545 23.1185 71.1672 19.4786 68.4466 16.5237C65.699 13.5554 62.2242 12.0645 57.9951 12.0645ZM40.0955 29.8745C40.0955 29.9014 40.0821 29.9148 40.0551 29.9148H33.5498C33.5364 29.9282 33.5229 29.9282 33.5095 29.9417C33.1054 31.4326 32.3511 32.7488 31.2467 33.9039C29.5093 35.6366 27.3005 36.5096 24.7011 36.5096C23.5967 36.5096 22.5731 36.3485 21.6303 36.0395C21.5899 35.9858 21.5629 35.9321 21.5091 35.8784V32.6011C21.5091 32.5071 21.4417 32.4399 21.3474 32.4399H15.5829C15.4752 32.4399 15.3944 32.3593 15.3944 32.2519V29.5925C15.3944 29.4984 15.4752 29.4178 15.5695 29.4178H21.3609C21.4552 29.4178 21.5225 29.3507 21.5225 29.2567V25.4824C21.5225 25.3884 21.4552 25.3213 21.3609 25.3213H15.5964C15.4887 25.3213 15.4079 25.2407 15.4079 25.1332V22.4738C15.4079 22.3798 15.4887 22.2992 15.5829 22.2992H21.3744C21.4687 22.2992 21.536 22.232 21.536 22.138V18.6324C21.5764 18.5787 21.6033 18.525 21.6437 18.4712C22.6 18.1623 23.6236 17.9877 24.7145 17.9877C27.3274 17.9877 29.5228 18.8608 31.2602 20.6471C32.432 21.8157 33.1997 23.1991 33.5768 24.7706C33.5903 24.784 33.6037 24.7974 33.6172 24.7974H40.0686C40.0955 24.7974 40.109 24.8109 40.109 24.8377V29.8745H40.0955ZM66.1704 24.8377H49.2406C49.2136 24.8377 49.1867 24.8109 49.2002 24.784C50.0891 20.4188 53.3215 17.7325 57.9412 17.7325C62.0356 17.7325 65.3354 20.1367 66.2243 24.784C66.2108 24.8109 66.1974 24.8377 66.1704 24.8377Z" fill="white"></path><path d="M98.7373 16.913C96.3669 13.676 92.9998 12.0508 88.5956 12.0508C84.5955 12.0508 81.2418 13.5014 78.4 16.4429C75.5581 19.3843 74.1709 22.9705 74.1709 27.2551C74.1709 31.4726 75.5581 35.1125 78.4 38.0674C81.2418 41.0089 84.5955 42.4595 88.5956 42.4595C92.9998 42.4595 96.3669 40.8343 98.7373 37.5436V41.7073H105V12.8029H98.7373V16.913ZM96.1379 33.9037C94.4005 35.6363 92.1917 36.5094 89.5923 36.5094C86.9794 36.5094 84.784 35.6363 83.0466 33.9037C81.3092 32.1173 80.4337 29.9145 80.4337 27.2551C80.4337 24.5957 81.3092 22.393 83.0466 20.6603C84.784 18.8739 86.9929 18.0009 89.5923 18.0009C92.2051 18.0009 94.4005 18.8739 96.1379 20.6603C97.8754 22.393 98.7508 24.5957 98.7508 27.2551C98.7373 29.9145 97.8754 32.1173 96.1379 33.9037Z" fill="white"></path>
              </svg>
              <div className="footer__icon">
                <div className="footer__logo-item">

                  <TelegramIcon />
                </div>

                <div className="footer__face-item">
                  <FacebookIcon />
                </div>
                <div className="footer__insta-item  ">
                  {<InstagramIcon />}
                </div>
              </div>
            </div>
            <div className="footer__card">
              <div className="footer__card-item">
                <h2 className='footer__card-title'>Xaridorga</h2>
                <a href='/' className='footer__subtitle'>savol-javob</a>
                <a href='/' className='footer__subtitle'>Saytda buyurtma berish</a>
                <a href='/' className='footer__subtitle'>Qaytarish va almashtirish</a>
              </div>

              <div className="footer__card-item">
                <h2 className='footer__card-title'>idea.uz</h2>
                <a href='/' className='footer__subtitle'>Biz haqimizda</a>
                <a href='/' className='footer__subtitle'>Bizning do'konlarimiz</a>
                <a href='/' className='footer__subtitle'>Aloqa </a>
              </div>

              <div className="footer__card-item">
                <h2 className='footer__card-title'>Ma'lumot</h2>
                <a href='/' className='footer__subtitle'>muddatli to'lovlar</a>
                <a href='/' className='footer__subtitle'>Oferta</a>
                <a href='/' className='footer__subtitle'>Vakansiyalar</a>
                <a href='/' className='footer__subtitle'>Maqolalar</a>
              </div>
              <div className="footer__card-item">
                <h2 className='footer__card-title'>Qayta Aloqa</h2>
                <button className='footer__button'>xabar qoldirish</button>
                <h2 className='footer__title'>71 230 77 99</h2>
                <a href='/' className='footer__subtitle'>Har kuni 9:00dan 21:00gacha</a>
                <h2 className='footer__title'>info@ideagroup.uz</h2>
                <a href='/' className="footer__subtitle">Pochta</a>
              </div>
            </div>
          </div>
          <p className='boot'>2025 © «idea.uz - интернет-магазин»</p>
        </div>
      </div>
    </footer>
  )
}

export default Footer